<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest KeyboardChecker and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.keyboardchecker</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KeyboardChecker</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/keyboardchecker</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>21</string>
            </array>
            <key>category</key>
            <string>21</string>
            <key>description</key>
            <string>KeyboardChecker</string>
            <key>developer</key>
            <string>21</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>unattended_uninstall</key>
            <false/>
            <key>uninstall_method</key>
            <string>removepackages</string>
            <key>uninstallable</key>
            <true/>
            <key>postinstall_script</key>
            <string>#!bin/bash
                launchctl unload /Library/LaunchDaemons/ru.21-school.keyboardchecker.plist
                pkill /usr/local/keyboardchecker/keyboardchecker
                chmod 600 /usr/local/keyboardchecker
				launchctl load /Library/LaunchDaemons/ru.21-school.keyboardchecker.plist
			</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>minimum_os_version</key>
    <string>10.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.keyboardchecker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>